Revit 2026 API

# OBJExportOptions Class

---

The export options used by exporting to OBJ file format.

SystemObject Autodesk.Revit.DBBIMExportOptions Autodesk.Revit.DBOBJExportOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class OBJExportOptions : BIMExportOptions
```
```vb
Public Class OBJExportOptions
	Inherits BIMExportOptions
```
```cpp
public ref class OBJExportOptions : public BIMExportOptions
```
```fsharp
type OBJExportOptions =
    class
        inherit BIMExportOptions
    end
```

The OBJExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | OBJExportOptions | Constructs a new instance of OBJExportOptions with default values of all properties. |
|  | OBJExportOptions(ExportResolution) | Constructs a new instance of OBJExportOptions with all predefined tessellation settings, depending on export resolution type. Note: in case of Custom resolution type, tessellation settings won't be predefined and will have default values. |

|  | Name | Description |
| --- | --- | --- |
|  | GridAspectRatio | The maximum aspect ratio allowed in the grid placed across the face. The minimum allowed value is 1.0. The maximum allowed value is 10.0. By default this property is ignored. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from BIMExportOptions) |
|  | MaxEdgeLength | The maximum length allowed for any chord on an edge or between any two adjacent grid lines. This is a percentage value. By exporting, the real value of maximum edge length is calculated as a percent from the length of the diameter of the body bounding box. The minimum allowed value is 0.1%. The maximum allowed value is 10.0%. By default this property is ignored. |
|  | NormalTolerance | The maximum change in the surface normal between adjacent nodes in the mesh. This property is defined in degrees. The minimum allowed value is 1.0 degrees. The maximum allowed value is 45.0 degrees. Default value is 15.0 degrees. |
|  | SurfaceTolerance | The maximum distance between mesh triangles and model geometry. This is a percentage value. By exporting, the real value of surface tolerance is calculated as a percent from the length of the diameter of the body bounding box. The minimum allowed value is 0.001%. The maximum allowed value is 1.0%. Default value is 0.1%. |
|  | TargetUnit | The unit type of geometry in the resultant OBJ file. Default value is ExportUnit::Default. |
|  | ViewId | The element id of the 3D view to export. InvalidElementId by default. (Inherited from BIMExportOptions) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from BIMExportOptions) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsGridAspectRatioSet | Checks whether the GridAspectRatio tessellation parameter is explicitly set. |
|  | IsMaxEdgeLengthSet | Checks whether the MaxEdgeLength tessellation parameter is explicitly set. |
|  | IsNormalToleranceSet | Checks whether the NormalTolerance tessellation parameter is explicitly set. |
|  | IsSurfaceToleranceSet | Checks whether the SurfaceTolerance tessellation parameter is explicitly set. |
|  | IsValidForGridAspectRatio | Checks whether the value is allowed (is in the allowed range) for GridAspectRatio tessellation parameter. |
|  | IsValidForMaxEdgeLength | Checks whether the value is allowed (is in the allowed range) for MaxEdgeLength tessellation parameter. |
|  | IsValidForNormalTolerance | Checks whether the value is allowed (is in the allowed range) for NormalTolerance tessellation parameter. |
|  | IsValidForSurfaceTolerance | Checks whether the value is allowed (is in the allowed range) for SurfaceTolerance tessellation parameter. |
|  | SetTessellationSettings | Sets all the tessellation parameters to its predefined values for the given resolution type. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace